# サインアップ画面でサインアップ

* サインアップ画面にアクセスする

## メールアドレスとパスワードを入力するとアカウントの作成に成功する
* メールの入力欄にメールアドレスを入力する
* パスワードの入力欄にパスワードを入力する
* アカウントを作成するボタンをクリックする
* ローディングが表示される
* アカウント作成の成功通知が表示される
* サインイン画面が表示されている

## メールアドレスを入力せずにアカウントの作成をクリックするとエラーが表示される
* アカウントを作成するボタンをクリックする
* メールに入力必須エラーが表示される

## パスワードを入力せずにアカウントの作成をクリックするとエラーが表示される
* アカウントを作成するボタンをクリックする
* パスワードに入力必須エラーが表示される

## メールアドレスを入力するとエラーが消える
* アカウントを作成するボタンをクリックする
* メールに入力必須エラーが表示される
* メールの入力欄にメールアドレスを入力する
* メールの入力必須エラーが表示されていない

## パスワードを入力するとエラーが消える
* アカウントを作成するボタンをクリックする
* パスワードに入力必須エラーが表示される
* パスワードの入力欄にパスワードを入力する
* パスワードの入力必須エラーが表示されていない

## サインイン画面へのリンクをクリックするとサインアップ画面に遷移する
* サインイン画面へのリンクをクリックする
* サインイン画面が表示されている
