# サインイン画面でサインイン

* サインイン画面にアクセスする

## メールアドレスとパスワードを入力するとサインインできる
* メールの入力欄にメールアドレスを入力する
* パスワードの入力欄にパスワードを入力する
* サインインボタンをクリックする
* ローディングが表示される
* サインインの成功通知が表示される
* TODO一覧画面が表示されている

## メールアドレスを入力せずにサインインボタンをクリックするとエラーが表示される
* サインインボタンをクリックする
* メールに入力必須エラーが表示される

## パスワードを入力せずにサインインボタンをクリックするとエラーが表示される
* サインインボタンをクリックする
* パスワードに入力必須エラーが表示される

## メールアドレスを入力するとエラーが消える
* サインインボタンをクリックする
* メールに入力必須エラーが表示される
* メールの入力欄にメールアドレスを入力する
* メールの入力必須エラーが表示されていない

## パスワードを入力するとエラーが消える
* サインインボタンをクリックする
* パスワードに入力必須エラーが表示される
* パスワードの入力欄にパスワードを入力する
* パスワードの入力必須エラーが表示されていない

## サインアップ画面へのリンクをクリックするとサインアップ画面に遷移する
* サインアップ画面へのリンクをクリックする
* サインアップ画面が表示されている