# Todo機能が使えること

* トップページにアクセスする
* サインイン画面が表示されている
* サインインをする
* TODO一覧画面が表示されている

##  TODOの入力フォームに入力をすると送信ボタンが活性化される
* TODOの送信ボタンが非活性である
* TODOの入力フォームに"新しいTODO"と入力する
* TODOの送信ボタンが活性化されている

## TODOの送信ボタンを押すとTODOが追加される
* TODOの入力フォームに"新しいTODO"と入力する
* TODOの送信ボタンをクリックする
* TODO"新しいTODO"が表示されている

## 新しく追加されたTODOは未完了である
* TODOの入力フォームに"新しいTODO"と入力する
* TODOの送信ボタンをクリックする
* TODO"新しいTODO"が表示されている
* TODO"新しいTODO"は未完了である

## TODOにはチェックボックスが表示されている
* TODO"古いTODO"が表示されている
* TODO"古いTODO"にチェックボックスが表示されている

## 未完了TODOのチェックボックスを押すとTODOが完了になる
* TODO"古いTODO"が表示されている
* TODO"古いTODO"のチェックボックスをクリックする
* TODO"古いTODO"は完了である

## 完了TODOのチェックボックスを押すとTODOが未完了になる
* TODO"古いTODO"が表示されている
* TODO"古いTODO"のチェックボックスをクリックする
* TODO"古いTODO"は完了である
* TODO"古いTODO"のチェックボックスをクリックする
* TODO"古いTODO"は未完了である

## TODOにカーソルを合わせると編集アイコンが表示される
* TODO"古いTODO"が表示されている
* TODO"古いTODO"に編集ボタンが表示されていない
* TODO"古いTODO"にカーソルを合わせる
* TODO"古いTODO"に編集ボタンが表示されている